package com.mtalaat.restaurant.modules.account.enums;

public enum AccountType {
    ASSET, // تمثل الأصول التي تمتلكها الشركة، مثل النقد، الحسابات البنكية، المخزون، والممتلكات.
    LIABILITY, // تمثل الالتزامات التي تتحملها الشركة، مثل القروض، الحسابات المستحقة الدفع، والديون.
    REVENUE, // تمثل الإيرادات التي تحققها الشركة من عملياتها، مثل المبيعات، العوائد، والإيرادات الأخرى.
    EQUITY, // تمثل حقوق الملكية في الشركة، مثل رأس المال، الأرباح المحتجزة، والأسهم.
    EXPENSE// تمثل المصروفات التي تنفقها الشركة في عملياتها، مثل تكلفة البضائع المباعة، الرواتب، الإيجار، والمصروفات الأخرى.
}
